Repository: luciacahojova/plantgress
Catalog: Plantgress/PresentationLayer/UIToolkit/Sources/Resources/Localizable/*.lproj/Localizable.strings
Languages: sk

# onboarding_login_button
source: Log In
sk: Prihlásiť

# onboarding_registration_button
source: Register
sk: Zaregistrovať

# login_title
source: Log In
sk: Prihlásenie

# registration_title
source: Register
sk: Regitrácia

# verification_link_title
source: Verification link sent
sk: Overovací odkaz bol odoslaný

# forgotten_password_title
source: Forgotten password
sk: Zabudnuté heslo

# onboarding_name_placeholder
source: Name
sk: Meno

# onboarding_surname_placeholder
source: Surname
sk: Priezvisko

# onboarding_password_placeholder
source: Password
sk: Heslo

# onboarding_repeat_password_placeholder
source: Repeat password
sk: Heslo znova

# login_send_verification_link_button
source: Send verification link
sk: Zaslať overovací odkaz

# verification_link_sent_message
source: A verification link has been sent to your email address. It may take a few minutes to arrive. Once verified, you can log into the app. If you didn’t receive the email, you can request to resend the link.
sk: Overovací odkaz bol odoslaný na vašu e-mailovú adresu. Môže trvať niekoľko minút, kým dorazí. Po overení sa môžete prihlásiť do aplikácie. Ak ste e-mail nedostali, môžete požiadať o opätovné odoslanie odkazu.

# resend_verification_link_button
source: Resend verification link
sk: Znova odoslať overovací odkaz

# email_already_verified_message
source: Your email address is already verified.
sk: Vaša e-mailová adresa už bola overená.

# email_verification_resent_snackbar_message
source: Email verification link has been resent.
sk: Overovací odkaz bol znovu odoslaný.

# password_reset_message
source: A reset link will be sent to the provided email address. If it doesn’t arrive within a few minutes, check the email address or resend the link.
sk: Odkaz na obnovenie hesla bude odoslaný na zadanú e-mailovú adresu. Ak neprišiel do niekoľkých minút, skontrolujte e-mailovú adresu alebo odošlite odkaz znova.

# reset_password_buttom
source: Send password reset
sk: Zaslat odkaz na obnovenie

# reset_password_snackbar_message
source: Password reset link has been sent.
sk: Odkaz na obdnovenie bol odoslaný.

# default_error_message
source: Something went wrong.
sk: Niečo sa pokazilo.

# invalid_email_format_error_message
source: Please enter a valid email address.
sk: Zadajte platnú e-mailovú adresu.

# email_already_in_use_error_message
source: Email is already in use.
sk: E-mailová adresa sa už používa.

# invalid_password_format_error_message
source: Password must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, and one number.
sk: Heslo musí mať aspoň 8 znakov a musí obsahovať aspoň jedno veľké písmeno, jedno malé písmeno a jedno číslo.

# passwords_dont_match_error_message
source: Passwords do not match.
sk: Heslá sa nezhodujú.

# email_not_verified_error_message
source: Your email address is not verified.
sk: Vaša e-mailová adresa nie je overená.

# too_many_requests_error_message
source: Too many requests.
sk: Príliš veľa požiadaviek.

# profile_title
source: Profile
sk: Profil

# account_title
source: Account
sk: Účet

# change_email_button
source: Change Email
sk: Zmeniť email

# change_name_button
source: Change Name
sk: Zmeniť meno

# change_password_button
source: Change Password
sk: Zmeniť heslo

# logout_button
source: Log Out
sk: Odhlásiť sa

# logout_alert_title
source: Logout
sk: Odhlásenie

# logout_alert_message
source: Are you sure you want to log out?
sk: Ste si istý, že sa chcete odhlásiť?

# delete_account_button
source: Delete Account
sk: Zmazať účet

# delete_account_alert_title
source: Delete Account
sk: Zmazanie účtu

# delete_account_alert_message
source: Are you sure you want to permanently delete your account?
sk: Ste si istý, že chcete natrvalo zmazať svoj účet?

# login_continute_message
source: To continue, you must log in again.
sk: Pre pokračovanie sa musíte znovu prihlásiť.

# explore_title
source: Explore
sk: Objavujte

# explore_title_with_emoji
source: Extra Tools 🔨
sk: Extra Funkcie 🔨

# plants_title
source: Plants
sk: Rastliny

# plants_title_with_emoji
source: Plants 🪴
sk: Rastliny 🪴

# rooms_title_with_emoji
source: Rooms 🏡
sk: Miestnosti 🏡

# tasks_title_with_emoji
source: Tasks 📝
sk: Úlohy 📝

# plant_collection_empty_message
source: You have no plants.
sk: Vaša zbierka rastlín je prázdna.

# track_button
source: Track
sk: Zaznamenať

# no_rooms_message
source: You have no rooms.
sk: Nemáte žiadne miestnosti.

# rooms_title
source: Rooms
sk: Miestnosti

# dismiss_button
source: Dismiss
sk: Zatvoriť

# cancel_button
source: Cancel
sk: Zrušiť

# close_button
source: Close
sk: Zavrieť

# delete_button
source: Delete
sk: Zmazať

# edit_button
source: Edit
sk: Upraviť

# pick_button
source: Pick
sk: Zvoliť

# discard_button
source: Discard
sk: Zrušiť

# undo_button
source: Undo
sk: Späť

# settings_button
source: Settings
sk: Nastavenia

# tasks_title
source: Tasks
sk: Úlohy

# task_start
source: Start
sk: Začiatok

# task_time
source: Time
sk: Čas

# task_completed_on_title
source: Completed on %@
sk: Dokončené dňa %@

# task_due_today_title
source: Today
sk: Dnes

# task_overdue_days_one_title
source: Overdue by 1 day
sk: Pred 1 dňom

# task_overdue_days_many_title
source: Overdue by %@ days
sk: Pred %@ dňami

# task_due_days_one_title
source: Due in 1 day
sk: O 1 deň

# task_due_days_few_title
source: Due in %@ days
sk: O %@ dni

# task_due_days_many_title
source: Due in %@ days
sk: O %@ dní

# no_tracked_tasks_message
source: You have no tracked tasks.
sk: Nemáte žiadne úlohy.

# completed_tasks_title
source: Completed Tasks
sk: Dokončené úlohy

# upcoming_tasks_title
source: Upcoming Tasks
sk: Nadchádzajúce úlohy

# task_delete_failed_snackbar_message
source: Failed to delete task.
sk: Odstránenie zlyhalo

# task_completed_snackbar_message
source: %@ completed
sk: %@ dokončené

# task_complete_failed_snackbar_message
source: Failed to complete task
sk: Zlyhalo dokončenie úlohy

# no_camera_access_alert_title
source: No Camera Access
sk: Povoľte prístup k fotoaparátu

# camera_permission_alert_message
source: To continue, grant access to your camera in Settings.
sk: Pre pokračovanie povoľte prístup k fotoaparátu v Nastaveniach

# no_photos_access_alert_title
source: No Photos Access
sk: Povoľte prístup k Fotkám

# photos_permission_alert_message
source: To continue, grant access to Photos in Settings.
sk: Pre pokračovanie povoľte prístup k Fotkám v Nastaveniach

# progress_saved_snackbar_message
source: Progress saved!
sk: Progres uložený!

# image_upload_failed_snackbar_message
source: Failed to upload image.
sk: Nahrávanie obrázka zlyhalo

# data_load_failed_snackbar_message
source: Failed to load.
sk: Niečo sa pokazilo.

# choose_action_title
source: Choose action
sk: Vyberte akciu

# camera_action
source: Camera
sk: Fotoaparát

# library_action
source: Library
sk: Fotky

# water_name
source: Water
sk: Zaliať

# inspect_name
source: Inspect
sk: Skontrolovať

# fertilize_name
source: Fertilize
sk: Pohnojiť

# clean_name
source: Clean
sk: Umyť

# repot_name
source: Repot
sk: Presadiť

# propagate_name
source: Propagate
sk: Rozmnožiť

# track_progress_name
source: Track Progress
sk: Sledovanie progresu

# watering_title
source: Watering
sk: Zalievanie

# pest_inspection_title
source: Pest Inspection
sk: Kontrola škodcov

# fertilizing_title
source: Fertilizing
sk: Hnojenie

# cleaning_title
source: Cleaning
sk: Čistenie

# repotting_title
source: Repotting
sk: Presádzanie

# propagating_title
source: Propagating
sk: Množenie

# progress_tracking_title
source: Progress Tracking
sk: Sledovanie progresu

# plant_creation_title
source: Add New Plant
sk: Pridanie Rastliny

# plant_creation_images
source: Images
sk: Obrázky

# plant_creation_notifications
source: Notifications
sk: Upozornenia

# plant_creation_repeat
source: Repeat
sk: Opakovanie

# plant_creation_custom
source: Custom
sk: Vlastné

# plant_creation_task_settings
source: Task Settings
sk: Nastavenia úloh

# plant_creation_name
source: Name
sk: Názov

# plant_creation_plant_name
source: Plant Name
sk: Názov rastliny

# plant_creation_room
source: Room
sk: Miestnosť

# plant_creation_select_room
source: Select Room
sk: Vyberte miestnosť

# plant_creation_delete_plant_button
source: Delete Plant
sk: Zmazať rastlinu

# plant_creation_update_button
source: Update
sk: Aktualizovať

# plant_creation_add_button
source: Add Plant
sk: Pridať rastlinu

# repeat_on_label
source: On
sk: V deň

# repeat_every_label
source: Every
sk: Opakovanie

# plant_creation_add_period_button
source: Add period
sk: Pridať periódu

# plant_creation_add_another_period_button
source: Add another period
sk: Pridať ďalšiu periódu

# plant_creation_add_another_tracking_periods_title
source: Tracking periods
sk: Nastavenie periód

# plant_creation_failed_to_delete_snackbar
source: Failed to delete plant.
sk: Zlyhalo odstránenie rastliny.

# plant_creation_delete_alert_title
source: Delete Plant
sk: Zmazať rastlinu

# plant_creation_delete_alert_message
source: Are you sure you want to delete this plant?
sk: Ste si istý, že chcete zmazať rastlinu?

# plant_creation_failed_to_delete_image_snackbar
source: Failed to delete image.
sk: Zlyhalo odstránenie obrázka.

# plant_creation_cancel_alert_title
source: Cancel Plant Creation
sk: Zrušiť vytvorenie rastliny

# plant_creation_cancel_alert_message
source: Are you sure you want to cancel plant creation?
sk: Ste si istý, že chcete zrušiť vytvorenie rastliny?

# plant_creation_failed_to_create_snackbar
source: Failed to create plant.
sk: Vytvorenie rastliny zlyhalo.

# plant_creation_failed_to_update_snackbar
source: Failed to update plant.
sk: Aktualizácia rastliny zlyhala.

# plant_creation_period_format
source: Period %@
sk: Perióda %@

# plant_creation_frequency
source: Frequency
sk: Frekvencia

# plant_creation_daily
source: Daily
sk: Denne

# plant_creation_weekly
source: Weekly
sk: Týždenne

# plant_creation_monthly
source: Monthly
sk: Mesačne

# plant_creation_yearly
source: Yearly
sk: Ročne

# plant_creation_sorted_months_format
source: %@ and %@
sk: %@ a %@

# repeat_daily_format_one
source: Repeats every day
sk: Opakuje sa každý deň

# repeat_daily_format_few
source: Repeats every %@ days
sk: Opakuje sa každé %@ dni

# repeat_daily_format_many
source: Repeats every %@ days
sk: Opakuje sa každých %@ dní

# repeat_weekly_format_one
source: Repeats every week on %@
sk: Opakuje sa každý týždeň počas dňa %@

# repeat_weekly_format_few
source: Repeats every %@ weeks on %@
sk: Opakuje sa každé %@ týždne počas dňa %@

# repeat_weekly_format_many
source: Repeats every %@ weeks on %@
sk: Opakuje sa každých %@ týždňov počas dňa %@

# repeat_monthly_format_one
source: Repeats every day in %@
sk: Opakuje sa každý deň v mesiaci %@

# repeat_monthly_format_few
source: Repeats every %@ days in %@
sk: Opakuje sa každé %@ dni v mesiaci %@

# repeat_monthly_format_many
source: Repeats every %@ days in %@
sk: Opakuje sa každých %@ dní v mesiaci %@

# repeat_yearly_format
source: Repeats every year on %@.%@
sk: Opakuje sa každý rok %@.%@.

# plant_creation_every_days_format_one
source: %@ day
sk: %@ deň

# plant_creation_every_days_format_few
source: %@ days
sk: %@ dni

# plant_creation_every_days_format_many
source: %@ days
sk: %@ dní

# plant_creation_every_weeks_format_one
source: %@ week
sk: %@ týždeň

# plant_creation_every_weeks_format_few
source: %@ weeks
sk: %@ týždne

# plant_creation_every_weeks_format_many
source: %@ weeks
sk: %@ týždňov

source: Delete Room
sk: Zmazať miestnosť

source: Update Room
sk: Uložiť

# create_room_button
source: Create Room
sk: Vytvoriť miestnosť

# room_name_placeholder
source: Room Name
sk: Názov miestnosti

# room_name_title
source: Name
sk: Názov

# room_deletion_alert_title
source: Room Deletion
sk: Zmazanie miestnosti

# room_deletion_alert_message
source: Are you sure you want to delete this room? Plants in the room won't be deleted.
sk: Ste si istý, že chcete zmazať túto miestnosť? Rastliny v miestnosti nebudú zmazané.

# failed_to_delete_room_snackbar
source: Failed to delete room.
sk: Zlyhalo odstránenie miestnosti.

# failed_to_update_room_snackbar
source: Failed to update room.
sk: Zlyhala aktualizácia miestnosti.

# failed_to_create_room_snackbar
source: Failed to create room.
sk: Zlyhalo vytvorenie miestnosti.

# no_plants_empty_content_message
source: You have no plants without a room.
sk: Nemáte žiadne rastliny bez priradenej rastliny.

# edit_room_title
source: Edit Room
sk: Upraviť miestnosť

# create_room_title
source: Create a Room
sk: Vytvorenie miestnosti

# no_plants_in_room_empty_content_message
source: There are no plants in this room.
sk: V tejto miestnosti nie sú žiadne rastliny.

# failed_to_remove_plant_from_room_snackbar
source: Failed to remove plant from room.
sk: Nepodarilo sa odstrániť rastlinu.
